Ра_новая/src/Tasks/ЗадачаПользователя/ЗадачаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаПользователя</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Испольнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий_Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий_Проверяющий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверяющий</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КомментарииИФайлы</name>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаФайл</name>
      <type>
        <types>CatalogRef.ЗадачаПользователяФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Task>

Ра_новая/src/Enums/СтатусыЗадач/СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадач</name>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>НадоСделать</name>
  </enumValues>
  <enumValues>
    <name>НаПроверке</name>
  </enumValues>
  <enumValues>
    <name>Отложена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

Ра_новая/src/Tasks/ЗадачаПользователя/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ИзменитьСтатус(массивЗадач,НовыйСтатус)	
	ИзменитьСтатусНаСервере(массивЗадач, НовыйСтатус);
	ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачаПользователя"));	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСтатусНаСервере(массивЗадач, новыйСтатус)
	Для Каждого текЗадача из массивЗадач Цикл 
		//Если новыйСтатус = Перечисления.СтатусыЗадач.Выполнено Тогда 
		//	Если  Не текЗадача.Выполнена Тогда
		//		Сообщение = Новый СообщениеПользователю;
		//		Сообщение.Текст = "нет";
		//		Сообщение.ПутьКДанным = "Объект";
		//		Сообщение.Сообщить();
		//	КонецЕсли;
		//	Продолжить;
		//КонецЕсли;	
		ЗадачаОбъект = текЗадача.ПолучитьОбъект(); 
		ЗадачаОбъект.Статус = новыйСтатус;
		Если новыйСтатус = Перечисления.СтатусыЗадач.Выполнено Тогда 
			 ЗадачаОбъект.Выполнена = Истина;
		КонецЕсли;	
		Попытка
			ЗадачаОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура СписокЗапланированоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	массивЗадач = ПараметрыПеретаскивания.Значение;
	ИзменитьСтатус(массивЗадач,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Запланировано"));
КонецПроцедуры

&НаКлиенте
Процедура СписокНадоСделатьПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	массивЗадач = ПараметрыПеретаскивания.Значение;
	ИзменитьСтатус(массивЗадач,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.НадоСделать"));
КонецПроцедуры

&НаКлиенте
Процедура СписокВыполняетсяПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	массивЗадач = ПараметрыПеретаскивания.Значение;
	ИзменитьСтатус(массивЗадач,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Выполняется"));
КонецПроцедуры

&НаКлиенте
Процедура СписокВыполненоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	массивЗадач = ПараметрыПеретаскивания.Значение;
	ИзменитьСтатус(массивЗадач,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Выполнено"));
КонецПроцедуры

&НаКлиенте
Процедура СписокНаПроверкеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	массивЗадач = ПараметрыПеретаскивания.Значение;
	ИзменитьСтатус(массивЗадач,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.НаПроверке"));
КонецПроцедуры

&НаКлиенте
Процедура СписокОтложенаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	массивЗадач = ПараметрыПеретаскивания.Значение;
	ИзменитьСтатус(массивЗадач,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Отложена"));
КонецПроцедуры

&НаКлиенте
Процедура СписокЗакрытаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	массивЗадач = ПараметрыПеретаскивания.Значение;
	ИзменитьСтатус(массивЗадач,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Отменена"));
КонецПроцедуры

&НаКлиенте
Процедура СписокОтмененаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	массивЗадач = ПараметрыПеретаскивания.Значение;
	ИзменитьСтатус(массивЗадач,ПредопределенноеЗначение("Перечисление.СтатусыЗадач.Закрыта"));
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент) 
	Если ЗначениеЗаполнено(Исполнитель) Тогда 
		УстановитьОтбор();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РольДоступнаНаСервере(Роль)
	Возврат  РольДоступна(Роль)
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Исполнитель 					= ПараметрыСеанса.ТекущийПользователь;
	Элементы.Исполнитель.Доступность= РольДоступнаНаСервере("РедактированиеЗадач");
	УстановитьОтбор(); 
КонецПроцедуры

&НаСервере  
Процедура УстановитьОтбор() 	
	 УстановитьОтборСписку(СписокВыполнено);
	 УстановитьОтборСписку(СписокВыполняется);
	 УстановитьОтборСписку(СписокЗакрыта);
	 //УстановитьОтборСписку(СписокЗапланировано);  
	 УстановитьОтборСписку(СписокНадоСделать);
	 УстановитьОтборСписку(СписокНаПроверке);
	 УстановитьОтборСписку(СписокОтложена);
	 УстановитьОтборСписку(СписокОтменена);
КонецПроцедуры	

&НаСервере
Процедура УстановитьОтборСписку(текСписок) 
	
	текСписок.Отбор.Элементы.Очистить(); 
	
	Отбор = текСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение= Исполнитель;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Испольнитель");
	Если Не РольДоступнаНаСервере("РедактированиеЗадач") Тогда 
		Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	КонецЕсли;	
	Отбор.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОчистка(Элемент, СтандартнаяОбработка)	
	  ИсполнительОчисткаНаСервере();
 КонецПроцедуры   
 
 &НаСервере
 Процедура ИсполнительОчисткаНаСервере()
	 
	 СписокВыполнено.Отбор.Элементы.Очистить();  
	 СписокВыполняется.Отбор.Элементы.Очистить();  
	 СписокЗакрыта.Отбор.Элементы.Очистить();  
	 СписокЗапланировано.Отбор.Элементы.Очистить();  
	 СписокНадоСделать.Отбор.Элементы.Очистить();  
	 СписокНаПроверке.Отбор.Элементы.Очистить();  
	 СписокОтложена.Отбор.Элементы.Очистить();  
	 СписокОтменена.Отбор.Элементы.Очистить();
	 
 КонецПроцедуры

&НаКлиенте
Процедура ПериодЗадачПриИзменении(Элемент)
	 УстановитьОтборСпискуПоДате(Элементы.СписокВыполнено);
	 УстановитьОтборСпискуПоДате(Элементы.СписокВыполняется);
	 УстановитьОтборСпискуПоДате(Элементы.СписокЗакрыта);
//	 УстановитьОтборСпискуПоДате(Элементы.СписокЗапланировано);  
	 УстановитьОтборСпискуПоДате(Элементы.СписокНадоСделать);
	 УстановитьОтборСпискуПоДате(Элементы.СписокНаПроверке);
	 УстановитьОтборСпискуПоДате(Элементы.СписокОтложена);
	 УстановитьОтборСпискуПоДате(Элементы.СписокОтменена);	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСпискуПоДате(текСписок) 	
	текСписок.Период = ПериодЗадач;
	текСписок.Обновить();
КонецПроцедуры
